Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_firewall.allowing-http will be created
+ resource "google_compute_firewall" "allowing-http" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allowing-http"
      + network            = "default"
      + priority           = 1000
      + project            = "tonal-benefit-462606-b8"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "http-server",
        ]

      + allow {
          + ports    = [
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.allowing-https will be created
+ resource "google_compute_firewall" "allowing-https" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allowing-https"
      + network            = "default"
      + priority           = 1000
      + project            = "tonal-benefit-462606-b8"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "https-server",
        ]

      + allow {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_instance.rocky_vms will be created
+ resource "google_compute_instance" "rocky_vms" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + creation_timestamp   = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + effective_labels     = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-medium"
      + metadata             = {
          + "ssh-keys" = "rocky:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCoWq1R4FwwGRLTDtwQviUkbNU+/Y1yDny5QiWVZZD61N/q4PPJQk9mFEqInvF6vnApmxCQfzsTMtzbh1xW6kQvSM4kobeJSqJtXdNYxouhX7M1NkiIje1sPzZc5RG+aQoRUnWc2IYPlowsRHJLhU7i35+cn5DIqLm+db2xx8F2RpbXfiJEtcq7wr6wnBnZat0yoTMMrRiKJXikv2A6sdIY8twkhDQH/y4UV/pS1tzBh8upCI5QWw4JXtyO0hWpKb79sXoCQOJYO9NWzMPNPTcVzFT4oQ/L63zS3812nFYI3ZuBda0pNxvCxLc4uKDj303GIubHB82w1wM/KZ4vbl78OZJoPzC2F5L5dw2d3mbkkoOnvgqGyaDK4AlgPNPYUZALmSCaG5lTVVBvFbKbtmXyzW5c/0Li7ob4kV3S84KjJRgqqiszzFS7BeJiVovGEcfhW9E05WakZryF51+Fl5UKX7XUMul8z1BifZGhYI2Slo0LoWl3eDRxlpXjK7BG/Vimr8iDkmvo6Jz3U32XRa92H7sueKiEEUclkr5fVDwAq5YSJVgPllRpP055+BjUJIe7lG8mCTEK9LlbJwalCVGYvPIULGiIyNofY8jz4FeO0EMDuMpAhlOIFqiSVGSh5SGBvmhJKGVNsTpVH1JQxCAew/KeqJSb2kMYdCiiVEfeGQ== penumarthigeeta@Penumarthis-MacBook-Pro.local"
        }
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "rocky-vm1"
      + project              = "tonal-benefit-462606-b8"
      + self_link            = (known after apply)
      + tags                 = [
          + "http-server",
          + "https-server",
          + "rocky",
        ]
      + tags_fingerprint     = (known after apply)
      + terraform_labels     = {
          + "goog-terraform-provisioned" = "true"
        }
      + zone                 = "asia-southeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + guest_os_features          = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + architecture           = (known after apply)
              + image                  = "rocky-linux-cloud/rocky-linux-8"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + resource_policies      = (known after apply)
              + size                   = 20
              + snapshot               = (known after apply)
              + type                   = (known after apply)
            }
        }

      + confidential_instance_config {
          + confidential_instance_type  = (known after apply)
          + enable_confidential_compute = (known after apply)
        }

      + guest_accelerator {
          + count = (known after apply)
          + type  = (known after apply)
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_attachment          = (known after apply)
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + availability_domain         = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)
          + termination_time            = (known after apply)

          + local_ssd_recovery_timeout {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + max_run_duration {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }

          + on_instance_stop_action {
              + discard_local_ssd = (known after apply)
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ vm_ip = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](http://310aaa9c3c7d:4141/lock?id=GeetaSree13%252Fterraform_ansible%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
